Revit 2027 API
BuiltInFailures.MassFailures.SketchCurveNotModelable Property
 This action cannot be completed. An element created by massing has a sketch line that cannot be modeled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchCurveNotModelable { get; }
Public Shared ReadOnly Property SketchCurveNotModelable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchCurveNotModelable {
	FailureDefinitionId^ get ();
}
static member SketchCurveNotModelable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace